# Задача 2: Найдите сумму цифр трехзначного числа.

sum=0
for i in input("Введите трёхзначное число: "):
    sum+=int(i)
print("ссума цифр в ашем числе: ",sum)
